In [1]:
import pandas as pd

In [ ]:
# Create a dataframe
data = {'Names':  ['Student 1', 'Student 2', 'Student 3'],
        'Age': [14, 15, 15],
        'Height': [150, 145, 152]
        }

df = pd.DataFrame(data)

In [2]:
# Print the dataframe
df

       Names  Age  Height
0  Student 1   14     150
1  Student 2   15     145
2  Student 3   15     152

In [3]:
print(df)

       Names  Age  Height
0  Student 1   14     150
1  Student 2   15     145
2  Student 3   15     152

In [4]:
df["Height"]

0    150
1    145
2    152
Name: Height, dtype: int64

In [5]:
df.shape

(3, 3)

In [4]:
# add new row of data
df = df.append({'Names' : 'Student 4', \
                'Age' : 16, \
                'Height' : 155}, \
                ignore_index=True)
print(df)

       Names  Age  Height
0  Student 1   14     150
1  Student 2   15     145
2  Student 3   15     152
3  Student 4   16     155

In [5]:
# add new column
grades = ["A", "B", "C", "B"]
df['grades'] = grades
print(df)

       Names  Age  Height grades
0  Student 1   14     150      A
1  Student 2   15     145      B
2  Student 3   15     152      C
3  Student 4   16     155      B

In [6]:
# Insert in a specific column 
df.pop('grades')  # remove last column
df.insert(1, 'Grades', grades)
print(df)

       Names Grades  Age  Height
0  Student 1      A   14     150
1  Student 2      B   15     145
2  Student 3      C   15     152
3  Student 4      B   16     155

In [7]:
# Edit a row 
df.loc[1] = ['Student 2', 'A', 15, 147]
print(df)

       Names Grades  Age  Height
0  Student 1      A   14     150
1  Student 2      A   15     147
2  Student 3      C   15     152
3  Student 4      B   16     155

In [8]:
# We can remove any row by 
df.drop(df.index[[2]], inplace=True)

# Drop last row 
# df.drop(df.index[[-1]], inplace=True)

print(df)

       Names Grades  Age  Height
0  Student 1      A   14     150
1  Student 2      A   15     147
3  Student 4      B   16     155

In [9]:
# Save as both excel and csv 
# df.to_csv('student_info.csv', index=False)
# df.to_excel('student_info.xlsx', index=False)

# Read the files 
# df_copy_csv = pd.read_csv('student_info.csv')
# df_copy_xlsx = pd.read_excel('student_info.xlsx')

In [14]:
df.sort_values(by="Age", ascending=False)

       Names Grades  Age  Height
3  Student 4      B   16     155
1  Student 2      A   15     147
0  Student 1      A   14     150

In [15]:
df[df["Height"] >= 150]

       Names Grades  Age  Height
0  Student 1      A   14     150
3  Student 4      B   16     155

In [23]:
# Add a new column. We will use datetime format
import datetime

In [24]:
date = [datetime.date(2020, 7, 2), datetime.date(2020, 7, 4), datetime.date(2020, 7, 5)]

In [25]:
df['Enrolment'] = date
df

       Names Grades  Age  Height   Enrolment
0  Student 1      A   14     150  2020-07-02
1  Student 2      A   15     147  2020-07-04
3  Student 4      B   16     155  2020-07-05

In [10]:
url = "https://pranabdas.github.io/drive/datasets/iris/iris.csv"
names = ["sepal_len", "sepal_width", "petal_len", "petal_width", "species"]
df = pd.read_csv(url, header=None, names=names)

In [11]:
df.shape

(150, 5)

In [12]:
df.head()

   sepal_len  sepal_width  petal_len  petal_width      species
0        5.1          3.5        1.4          0.2  Iris-setosa
1        4.9          3.0        1.4          0.2  Iris-setosa
2        4.7          3.2        1.3          0.2  Iris-setosa
3        4.6          3.1        1.5          0.2  Iris-setosa
4        5.0          3.6        1.4          0.2  Iris-setosa

In [13]:
df.head(10)

   sepal_len  sepal_width  petal_len  petal_width      species
0        5.1          3.5        1.4          0.2  Iris-setosa
1        4.9          3.0        1.4          0.2  Iris-setosa
2        4.7          3.2        1.3          0.2  Iris-setosa
3        4.6          3.1        1.5          0.2  Iris-setosa
4        5.0          3.6        1.4          0.2  Iris-setosa
5        5.4          3.9        1.7          0.4  Iris-setosa
6        4.6          3.4        1.4          0.3  Iris-setosa
7        5.0          3.4        1.5          0.2  Iris-setosa
8        4.4          2.9        1.4          0.2  Iris-setosa
9        4.9          3.1        1.5          0.1  Iris-setosa

In [14]:
df.tail()

     sepal_len  sepal_width  petal_len  petal_width         species
145        6.7          3.0        5.2          2.3  Iris-virginica
146        6.3          2.5        5.0          1.9  Iris-virginica
147        6.5          3.0        5.2          2.0  Iris-virginica
148        6.2          3.4        5.4          2.3  Iris-virginica
149        5.9          3.0        5.1          1.8  Iris-virginica

In [16]:
df.loc[15:20]

    sepal_len  sepal_width  petal_len  petal_width      species
15        5.7          4.4        1.5          0.4  Iris-setosa
16        5.4          3.9        1.3          0.4  Iris-setosa
17        5.1          3.5        1.4          0.3  Iris-setosa
18        5.7          3.8        1.7          0.3  Iris-setosa
19        5.1          3.8        1.5          0.3  Iris-setosa
20        5.4          3.4        1.7          0.2  Iris-setosa

In [17]:
df.loc[15:20, "sepal_len"]

15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
Name: sepal_len, dtype: float64

In [22]:
df.iloc[15:20, 0:2]

    sepal_len  sepal_width
15        5.7          4.4
16        5.4          3.9
17        5.1          3.5
18        5.7          3.8
19        5.1          3.8

In [15]:
df.dtypes

sepal_len      float64
sepal_width    float64
petal_len      float64
petal_width    float64
species         object
dtype: object

In [23]:
data.head()

   sepal_len  sepal_width  petal_len  petal_width        class
0        5.1          3.5        1.4          0.2  Iris-setosa
1        4.9          3.0        1.4          0.2  Iris-setosa
2        4.7          3.2        1.3          0.2  Iris-setosa
3        4.6          3.1        1.5          0.2  Iris-setosa
4        5.0          3.6        1.4          0.2  Iris-setosa

In [24]:
df["sepal_len"] = df["sepal_len"].astype(int)

In [26]:
df.dtypes

sepal_len        int64
sepal_width    float64
petal_len      float64
petal_width    float64
class           object
dtype: object

In [34]:
df["species"] = df["species"].str.replace("Iris-", "")

In [35]:
df

     sepal_len  sepal_width  petal_len  petal_width    species
0          5.1          3.5        1.4          0.2     setosa
1          4.9          3.0        1.4          0.2     setosa
2          4.7          3.2        1.3          0.2     setosa
3          4.6          3.1        1.5          0.2     setosa
4          5.0          3.6        1.4          0.2     setosa
..         ...          ...        ...          ...        ...
145        6.7          3.0        5.2          2.3  virginica
146        6.3          2.5        5.0          1.9  virginica
147        6.5          3.0        5.2          2.0  virginica
148        6.2          3.4        5.4          2.3  virginica
149        5.9          3.0        5.1          1.8  virginica

[150 rows x 5 columns]

In [37]:
df["species"] = df["species"].str.strip()
df

     sepal_len  sepal_width  petal_len  petal_width    species
0          5.1          3.5        1.4          0.2     setosa
1          4.9          3.0        1.4          0.2     setosa
2          4.7          3.2        1.3          0.2     setosa
3          4.6          3.1        1.5          0.2     setosa
4          5.0          3.6        1.4          0.2     setosa
..         ...          ...        ...          ...        ...
145        6.7          3.0        5.2          2.3  virginica
146        6.3          2.5        5.0          1.9  virginica
147        6.5          3.0        5.2          2.0  virginica
148        6.2          3.4        5.4          2.3  virginica
149        5.9          3.0        5.1          1.8  virginica

[150 rows x 5 columns]

In [39]:
df["species"] = df["species"].str.title()
# df["species"] = df["species"].str.upper()
# df["species"] = df["species"].str.lower()
df.head()

   sepal_len  sepal_width  petal_len  petal_width species
0        5.1          3.5        1.4          0.2  Setosa
1        4.9          3.0        1.4          0.2  Setosa
2        4.7          3.2        1.3          0.2  Setosa
3        4.6          3.1        1.5          0.2  Setosa
4        5.0          3.6        1.4          0.2  Setosa

In [40]:
names = pd.Series(['Albert Einstein', 'Richard Feynman', 'Issac Newton'])

In [41]:
names = names.str.split(" ")
names

0    [Albert, Einstein]
1    [Richard, Feynman]
2       [Issac, Newton]
dtype: object

In [42]:
names = pd.Series([i[::-1] for i in names])
names

0    [Einstein, Albert]
1    [Feynman, Richard]
2       [Newton, Issac]
dtype: object

In [43]:
names = [" ".join(i) for i in names]
names

['Einstein Albert', 'Feynman Richard', 'Newton Issac']

In [44]:
print(names)

['Einstein Albert', 'Feynman Richard', 'Newton Issac']